tap "candid82/brew"
tap "cdr/coder"
tap "cloudflare/cloudflare"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "yqrashawn/goku"
brew "act"
brew "angle-grinder"
brew "aria2"
brew "bash"
brew "bat"
brew "sqlite"
brew "libx11"
brew "cheat"
brew "cliclick"
brew "colordiff"
brew "coreutils"
brew "curl"
brew "diff-so-fancy"
brew "diffutils"
brew "editorconfig"
brew "emojify"
brew "entr"
brew "exa"
brew "expect"
brew "fd"
brew "findutils"
brew "fish"
brew "fpp"
brew "fzf"
brew "gcc"
brew "gh"
brew "gist"
brew "git"
brew "git-extras"
brew "git-flow"
brew "git-lfs"
brew "gnupg"
brew "go"
brew "gts"
brew "graphviz"
brew "grep"
brew "htop"
brew "jq"
brew "lazygit"
brew "ldns"
brew "less"
brew "lnav"
brew "neofetch"
brew "neovim"
brew "nmap"
brew "openssh"
brew "pigz"
brew "postgresql", restart_service: true
brew "qpdf"
brew "radare2"
brew "redis", restart_service: true
brew "ripgrep"
brew "rlwrap"
brew "scrcpy"
brew "shellcheck"
brew "sqlmap"
brew "stylua"
brew "subversion"
brew "tealdeer"
brew "the_silver_searcher"
brew "tig"
brew "tmux"
brew "tokei"
brew "unzip"
brew "wget"
brew "zsh"
brew "cdr/coder/coder-cli"
brew "cloudflare/cloudflare/cloudflared"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai", args: ["HEAD"]
brew "yqrashawn/goku/goku"
cask "1password"
cask "1password-cli"
cask "airtable"
cask "alfred"
cask "altair-graphql-client"
cask "amethyst"
cask "android-platform-tools"
cask "binance"
cask "blue-sherpa"
cask "cardhop"
cask "charles"
cask "cloudflare-warp"
cask "contexts"
cask "daisydisk"
cask "discord"
cask "docker"
cask "dropbox"
cask "fantastical"
cask "fig"
cask "fing"
cask "firefox"
cask "font-ia-writer-duo"
cask "font-ia-writer-duospace"
cask "font-ia-writer-mono"
cask "font-ia-writer-quattro"
cask "font-inter"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-roboto"
cask "google-chrome"
cask "handbrake"
cask "hey"
cask "insomnia"
cask "iterm2"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "keybase"
cask "keyboard-maestro"
cask "keycastr"
cask "kitty"
cask "krisp"
cask "linear-linear"
cask "little-snitch"
cask "logitech-presentation"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "minecraft"
cask "netron"
cask "ngrok"
cask "notion"
cask "obs"
cask "obsidian"
cask "pdf-expert"
cask "prisma-studio"
cask "raindropio"
cask "raycast"
cask "rectangle"
cask "sketch"
cask "slack"
cask "spotify"
cask "switchresx"
cask "teamviewer"
cask "tradingview"
cask "ubersicht"
cask "vanilla"
cask "visual-studio-code"
cask "wireshark"
cask "xquartz"
cask "zoom"
