tap "abhinav/tap"
tap "borkdude/brew"
tap "felixkratz/formulae"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "localsend/localsend"
tap "nikitabobko/tap"
tap "oven-sh/bun"
brew "act"
brew "caddy"
brew "clojure"
brew "cloudflared"
brew "eza"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gh"
brew "ghostscript"
brew "git"
brew "gnu-sed"
brew "gnupg"
brew "graphviz"
brew "imagemagick"
brew "jq"
brew "mise"
brew "n"
brew "neovim"
brew "nmap"
brew "node@16"
brew "node@18"
brew "node@20"
brew "nss"
brew "openjdk@17"
brew "openjdk@21", link: true
brew "pdftk-java"
brew "pgcli"
brew "pinentry-mac"
brew "pipx"
brew "pngquant"
brew "pnpm", link: false
brew "postgresql@14", restart_service: :changed
brew "qpdf"
brew "ranger"
brew "redis"
brew "ripgrep"
brew "sccache"
brew "the_silver_searcher"
brew "tmux"
brew "wget"
brew "yazi"
brew "yt-dlp"
brew "zellij"
brew "abhinav/tap/git-spice", link: false
brew "borkdude/brew/babashka"
brew "borkdude/brew/clj-kondo"
brew "felixkratz/formulae/sketchybar"
brew "oven-sh/bun/bun"
cask "1password"
cask "1password-cli"
cask "aerospace"
cask "affinity-designer"
cask "affinity-photo"
cask "alfred"
cask "android-platform-tools"
cask "android-sdk"
cask "arc"
cask "bambu-studio"
cask "brave-browser"
cask "bruno"
cask "chatgpt"
cask "cinebench"
cask "claude"
cask "cloudflare-warp"
cask "contexts"
cask "cursor"
cask "cyberduck"
cask "cycling74-max"
cask "daisydisk"
cask "dropbox"
cask "fing"
cask "firefox"
cask "flutter"
cask "font-zed-mono"
cask "ghostty"
cask "google-chrome"
cask "google-cloud-sdk"
cask "graalvm-jdk@21"
cask "hammerspoon"
cask "handbrake"
cask "jetbrains-toolbox"
cask "keyboard-maestro"
cask "kit"
cask "kitty"
cask "krisp"
cask "linear-linear"
cask "little-snitch"
cask "localsend"
cask "loom"
cask "loopback"
cask "meshlab"
cask "neat"
cask "neovide"
cask "notion"
cask "notion-calendar"
cask "obs"
cask "obsidian"
cask "orbstack"
cask "orcaslicer"
cask "osquery"
cask "pd"
cask "pdf-expert"
cask "prismlauncher"
cask "raycast"
cask "rewind"
cask "setapp"
cask "shortcat"
cask "slack"
cask "steam"
cask "tailscale"
cask "touchdesigner"
cask "visual-studio-code"
cask "warp"
cask "zed"
cask "zen-browser"
cask "zoom"
vscode "aaron-bond.better-comments"
vscode "andrewleedham.vscode-css-modules"
vscode "antfu.browse-lite"
vscode "antfu.iconify"
vscode "antfu.icons-carbon"
vscode "antfu.unocss"
vscode "antfu.vite"
vscode "ardenivanov.svelte-intellisense"
vscode "astro-build.astro-vscode"
vscode "asvetliakov.vscode-neovim"
vscode "austenc.tailwind-docs"
vscode "betterthantomorrow.calva"
vscode "betterthantomorrow.calva-spritz"
vscode "boyswan.glsl-literal"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "christian-kohler.npm-intellisense"
vscode "continue.continue"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "drcika.apc-extension"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "figma.figma-vscode-extension"
vscode "firsttris.vscode-jest-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "hbenl.vscode-test-explorer"
vscode "humao.rest-client"
vscode "jakebecker.elixir-ls"
vscode "johnlindquist.kit-extension"
vscode "limejuly.vscode-yaml-block-highlight"
vscode "mechatroner.rainbow-csv"
vscode "mongodb.mongodb-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vscode.vscode-speech"
vscode "naumovs.color-highlight"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "pveyes.aperture"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "shopify.ruby-lsp"
vscode "skyapps.fish-vscode"
vscode "slevesque.shader"
vscode "styled-components.vscode-styled-components"
vscode "supermaven.supermaven"
vscode "svelte.svelte-vscode"
vscode "swellaby.rust-pack"
vscode "swellaby.vscode-rust-test-adapter"
vscode "tamasfe.even-better-toml"
vscode "tamuratak.vscode-lezer"
vscode "thebearingedge.vscode-sql-lit"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vitest.explorer"
vscode "vue.volar"
vscode "vunguyentuan.vscode-css-variables"
vscode "wakatime.vscode-wakatime"
vscode "wallabyjs.console-ninja"
vscode "wallabyjs.quokka-vscode"
vscode "wallabyjs.wallaby-extension-pack"
vscode "wallabyjs.wallaby-vscode"
vscode "xadillax.viml"
vscode "ziglang.vscode-zig"
