tap "borkdude/brew"
tap "candid82/brew"
tap "cdr/coder"
tap "clojure/tools"
tap "d12frosted/emacs-plus"
tap "derailed/k9s"
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "jdxcode/tap"
tap "koekeishiya/formulae"
tap "lencx/chatgpt", "https://github.com/lencx/ChatGPT.git"
tap "michaeleisel/zld"
tap "modularml/packages"
tap "mongodb/brew"
tap "osx-cross/avr"
tap "planetscale/tap"
tap "railwayapp/tap"
tap "riscv-software-src/riscv"
tap "stripe/stripe-cli"
tap "teamookla/speedtest"
tap "tinygo-org/tools"
tap "yqrashawn/goku"
brew "act"
brew "angle-grinder"
brew "giflib"
brew "zstd"
brew "jpeg-xl"
brew "aom"
brew "freetype"
brew "glib"
brew "pkg-config"
brew "pixman"
brew "cairo"
brew "harfbuzz"
brew "openjdk"
brew "apktool"
brew "readline"
brew "sqlite"
brew "aria2"
brew "asio"
brew "assimp"
brew "boost"
brew "avrdude"
brew "bash"
brew "bat"
brew "binutils"
brew "bison"
brew "broot"
brew "gmp"
brew "isl"
brew "mpfr"
brew "libmpc"
brew "gcc"
brew "btop"
brew "bullet"
brew "bundletool"
brew "eigen"
brew "cheat"
brew "chezmoi"
brew "clang-format"
brew "cliclick"
brew "cmake"
brew "colordiff"
brew "console_bridge"
brew "coreutils"
brew "pcre"
brew "tinyxml2"
brew "cppcheck"
brew "crystal"
brew "cspice"
brew "csvkit"
brew "cunit"
brew "curl"
brew "dex2jar"
brew "dfu-util"
brew "diff-so-fancy"
brew "diffutils"
brew "dive"
brew "duckdb"
brew "editorconfig"
brew "elan-init"
brew "unixodbc"
brew "wxwidgets"
brew "erlang"
brew "elixir"
brew "emojify"
brew "entr"
brew "exa"
brew "expat"
brew "expect"
brew "fd"
brew "ferium"
brew "unbound"
brew "gnutls"
brew "libarchive"
brew "pango"
brew "tesseract"
brew "ffmpeg"
brew "findutils"
brew "fish"
brew "flamegraph"
brew "fpp"
brew "node"
brew "fx"
brew "fzf"
brew "gawk"
brew "libavif"
brew "gd"
brew "gdk-pixbuf"
brew "gh"
brew "ghostscript"
brew "gist"
brew "git"
brew "git-extras"
brew "git-flow"
brew "git-lfs"
brew "glow"
brew "gnu-sed"
brew "gnu-typist"
brew "gnupg"
brew "gnupg@1.4"
brew "gnuplot"
brew "python@3.11"
brew "gobject-introspection"
brew "gradle"
brew "librsvg"
brew "graphviz"
brew "grep"
brew "haskell-stack"
brew "hdf5"
brew "helix"
brew "htop"
brew "httpie", link: false
brew "hyperfine"
brew "shared-mime-info"
brew "libheif"
brew "python@3.9"
brew "libraw"
brew "imagemagick"
brew "inetutils"
brew "jadx"
brew "jpeg", link: true
brew "jq"
brew "julia"
brew "kotlin"
brew "lazydocker"
brew "lazygit"
brew "ldns"
brew "less"
brew "libfido2"
brew "libpq"
brew "libqalculate"
brew "lnav"
brew "lsusb"
brew "luv"
brew "mathlibtools"
brew "micropython"
brew "molten-vk"
brew "mongosh"
brew "qemu"
brew "podman"
brew "mongodb-atlas-cli"
brew "mosh"
brew "mprocs"
brew "zlib"
brew "mysql-client"
brew "ncspot"
brew "neofetch"
brew "neovim"
brew "neovide", link: false
brew "netcdf"
brew "nim", link: false
brew "nmap"
brew "node@16"
brew "nushell"
brew "ocaml"
brew "ollama"
brew "opam"
brew "open-ocd"
brew "vtk"
brew "opencv"
brew "openjdk@17"
brew "openssh"
brew "orocos-kdl"
brew "peco"
brew "python-tabulate", link: false
brew "pgcli"
brew "postgresql@14"
brew "pgvector"
brew "php"
brew "pidcat"
brew "pinentry-mac"
brew "planck"
brew "pnpm"
brew "pocketbase"
brew "poco"
brew "postgresql@15", restart_service: true
brew "protobuf-c"
brew "proxychains-ng"
brew "pulumi"
brew "py-spy"
brew "qt@5"
brew "pyqt@5"
brew "python@3.10"
brew "qpdf"
brew "radare2"
brew "ranger"
brew "redis", restart_service: true
brew "ripgrep"
brew "rizin"
brew "rlwrap"
brew "ruby"
brew "ruby-build"
brew "sccache"
brew "shellcheck"
brew "sip"
brew "spdlog"
brew "sshpass"
brew "starship"
brew "stylua"
brew "tealdeer"
brew "terminal-notifier"
brew "terraform"
brew "texinfo"
brew "texlive"
brew "the_silver_searcher"
brew "tig"
brew "tinyxml"
brew "tmux"
brew "tokei"
brew "tor"
brew "transmission-cli"
brew "unzip"
brew "vale"
brew "wasmer"
brew "wget"
brew "youtube-dl"
brew "zellij"
brew "zig"
brew "zsh"
brew "borkdude/brew/babashka"
brew "cdr/coder/coder@1"
brew "clojure/tools/clojure"
brew "d12frosted/emacs-plus/emacs-plus@30", args: ["with-imagemagick", "with-mailutils", "with-native-comp", "with-xwidgets"]
brew "derailed/k9s/k9s"
brew "felixkratz/formulae/sketchybar"
brew "jdxcode/tap/rtx"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "modularml/packages/modular"
brew "mongodb/brew/mongodb-database-tools"
brew "mongodb/brew/mongodb-community"
brew "mongodb/brew/mongodb-community-shell"
brew "osx-cross/avr/avr-gcc@9"
brew "planetscale/tap/pscale"
brew "railwayapp/tap/nixpacks"
brew "riscv-software-src/riscv/riscv-tools"
brew "stripe/stripe-cli/stripe"
brew "teamookla/speedtest/speedtest"
brew "tinygo-org/tools/tinygo"
brew "yqrashawn/goku/goku"
cask "1password"
cask "1password-cli"
cask "aerial"
cask "airtable"
cask "alfred"
cask "altair-graphql-client"
cask "android-commandlinetools"
cask "android-platform-tools"
cask "angry-ip-scanner"
cask "audacity"
cask "audio-hijack"
cask "aws-vpn-client"
cask "betterdisplay"
cask "blender"
cask "bruno"
cask "burp-suite"
cask "cardhop"
cask "charles"
cask "chatgpt"
cask "cloudflare-warp"
cask "contexts"
cask "cursor"
cask "cutter"
cask "cyberduck"
cask "daisydisk"
cask "discord"
cask "fantastical"
cask "fig"
cask "fing"
cask "fing-cli"
cask "firefox"
cask "fl-studio"
cask "font-commit-mono-nerd-font"
cask "font-geist-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-ia-writer-duo"
cask "font-ia-writer-mono"
cask "font-ia-writer-quattro"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-monaspace-nerd-font"
cask "gcc-arm-embedded"
cask "ghidra"
cask "github"
cask "google-chrome"
cask "google-cloud-sdk"
cask "hammerspoon"
cask "handbrake"
cask "hiddenbar"
cask "home-assistant"
cask "http-toolkit"
cask "httpie"
cask "imhex"
cask "iterm2"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "keyboard-maestro"
cask "keycastr"
cask "kitty"
cask "krisp"
cask "lens"
cask "linear-linear"
cask "little-snitch"
cask "llamachat"
cask "lm-studio"
cask "logitech-g-hub"
cask "logitech-presentation"
cask "logseq"
cask "loom"
cask "loopback"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "minecraft"
cask "mongodb-compass"
cask "monodraw"
cask "mqttx"
cask "musescore"
cask "neovide"
cask "ngrok"
cask "nosql-workbench"
cask "notion"
cask "obs"
cask "obsidian"
cask "omnifocus"
cask "openmtp"
cask "orbstack"
cask "origin"
cask "orion"
cask "parallels"
cask "pd"
cask "pdf-expert"
cask "postman"
cask "prisma-studio"
cask "prismlauncher"
cask "raycast"
cask "reflector"
cask "setapp"
cask "shottr"
cask "skim"
cask "slack"
cask "sonic-pi"
cask "spotify"
cask "steam"
cask "swiftbar"
cask "switchresx"
cask "synthesia"
cask "tabby"
cask "tailscale"
cask "telegram"
cask "tidal"
cask "todoist"
cask "topnotch"
cask "tor-browser"
cask "transmission-remote-gui"
cask "ubersicht"
cask "via"
cask "visual-studio-code"
cask "vmware-fusion"
cask "webtorrent"
cask "wireshark"
cask "xbar"
cask "zed"
cask "zerotier-one"
cask "zoom"
cask "zotero"
