tap "alexanderwillner/tap"
tap "bazelbuild/tap", pin: true
tap "caskroom/cask"
tap "danielbayley/alfred"
tap "dart-lang/dart"
tap "eth-p/software"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "linode/cli"
tap "linux-noah/noah"
tap "loadimpact/k6"
tap "miderwong/flutter"
tap "mikhailai/misc"
tap "molovo/revolver"
tap "mongodb/brew"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "rockymadden/rockymadden"
cask "osxfuse"
cask "xquartz"
brew "ack"
brew "openssl@1.1"
brew "readline"
brew "sqlite"
brew "aircrack-ng"
brew "angle-grinder"
brew "ansifilter"
brew "apktool"
brew "arduino-cli"
brew "aria2"
brew "xz"
brew "asciinema"
brew "gettext"
brew "glib"
brew "autojump"
brew "libusb"
brew "avrdude"
brew "awscli"
brew "bash"
brew "bash-completion@2"
brew "bat"
brew "bfg"
brew "binutils"
brew "blueutil"
brew "boost"
brew "boot-clj"
brew "brightness"
brew "bvi"
brew "capstone"
brew "cmake"
brew "gcc"
brew "cheat"
brew "circleci"
brew "cliclick"
brew "rlwrap"
brew "clojure"
brew "colordiff"
brew "coreutils"
brew "cowsay"
brew "ctags"
brew "curl"
brew "delta"
brew "deno"
brew "dex2jar"
brew "dfu-util"
brew "dhex"
brew "diff-so-fancy"
brew "diffutils"
brew "doctl"
brew "ed", link: true
brew "editorconfig"
brew "elinks"
brew "elixir"
brew "emojify"
brew "entr"
brew "exa"
brew "exiftool"
brew "ext4fuse"
brew "fasd"
brew "fastlane", link: false
brew "fd"
brew "fdupes"
brew "feh"
brew "gnutls"
brew "ffmpeg"
brew "figlet"
brew "findutils"
brew "fish"
brew "fortune"
brew "fpp"
brew "fsevents-tools"
brew "fswatch"
brew "fzf"
brew "gawk"
brew "gcsfuse"
brew "pkg-config"
brew "gdb"
brew "gdrive"
brew "gist"
brew "git"
brew "git-extras"
brew "git-flow"
brew "git-lfs"
brew "glew"
brew "glfw"
brew "glm"
brew "glslang"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-which"
brew "gnupg"
brew "go"
brew "googler"
brew "gptfdisk"
brew "gradle"
brew "graphviz"
brew "grc"
brew "grep"
brew "gstreamer"
brew "gst-plugins-base"
brew "gst-plugins-bad"
brew "gst-plugins-good"
brew "gst-rtsp-server"
brew "gzip"
brew "hexedit"
brew "htop"
brew "hub"
brew "icarus-verilog"
brew "libusbmuxd", args: ["HEAD"], link: false
brew "libimobiledevice"
brew "ideviceinstaller", link: false
brew "imagemagick", link: false
brew "ios-deploy"
brew "jadx"
brew "jq"
brew "kaitai-struct-compiler"
brew "keystone"
brew "kotlin"
brew "leiningen"
brew "less"
brew "lesspipe"
brew "libconfig"
brew "libdnet"
brew "libftdi"
brew "libmagic"
brew "libxml2"
brew "llvm"
brew "lnav"
brew "lynx"
brew "m-cli"
brew "m4"
brew "mackup"
brew "make"
brew "mbedtls"
brew "megatools"
brew "micronaut"
brew "minicom"
brew "protobuf"
brew "mosh"
brew "mpv"
brew "mycli"
brew "mysql"
brew "nasm"
brew "ncdu"
brew "neofetch"
brew "neovim"
brew "ninja"
brew "nmap"
brew "open-ocd"
brew "opencv"
brew "openssh"
brew "p7zip"
brew "parallel"
brew "qt"
brew "pdf2svg"
brew "peco"
brew "pgcli"
brew "planck"
brew "plowshare"
brew "pngquant"
brew "polipo"
brew "portaudio"
brew "postgresql"
brew "privoxy"
brew "progress"
brew "proxychains-ng"
brew "pv"
brew "pyenv"
brew "qemu"
brew "qrencode"
brew "radare2"
brew "rbspy"
brew "rclone"
brew "reattach-to-user-namespace"
brew "redis"
brew "rename"
brew "ripgrep"
brew "rsync"
brew "ruby-build"
brew "sbt"
brew "scala"
brew "screen"
brew "selecta"
brew "shellcheck"
brew "shpotify"
brew "simple-mtpfs"
brew "socat"
brew "sox"
brew "sqlmap"
brew "sshfs"
brew "stlink"
brew "swig"
brew "switchaudio-osx"
brew "tcpdump"
brew "tcpkali"
brew "tealdeer"
brew "telnet"
brew "terraform"
brew "the_silver_searcher"
brew "thefuck"
brew "tig"
brew "tldr", link: false
brew "tmux"
brew "toilet"
brew "tokei"
brew "tor"
brew "transmission-cli"
brew "unicorn"
brew "unrar"
brew "unzip"
brew "vault"
brew "verilator"
brew "w3m"
brew "wabt"
brew "weechat"
brew "wget"
brew "wrk"
brew "xonsh"
brew "yajl"
brew "z"
brew "z3"
brew "zlib"
brew "zsh"
brew "alexanderwillner/tap/things.sh"
brew "bazelbuild/tap/bazel"
brew "dart-lang/dart/dart"
brew "eth-p/software/bat-extras"
brew "heroku/brew/heroku"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "linode/cli/linode-cli"
brew "linux-noah/noah/noah"
brew "loadimpact/k6/k6"
brew "mikhailai/misc/usbutils"
brew "molovo/revolver/revolver"
brew "mongodb/brew/mongodb-community"
brew "osx-cross/arm/arm-gcc-bin", link: false
brew "osx-cross/avr/simavr", args: ["HEAD"]
brew "rockymadden/rockymadden/slack-cli"
cask "1password"
cask "adobe-creative-cloud"
cask "airdroid"
cask "airtable"
cask "alacritty"
cask "alfred"
cask "amethyst"
cask "arduino"
cask "atom-beta"
cask "calibre"
cask "caprine"
cask "charles"
cask "contexts"
cask "daisydisk"
cask "dash"
cask "discord"
cask "docker"
cask "dropbox"
cask "duet"
cask "emacs"
cask "epic-games"
cask "evernote"
cask "fantastical"
cask "fastlane"
cask "figma"
cask "fiji"
cask "fing"
cask "firefox"
cask "firefox-developer-edition"
cask "font-firacode-nerd-font"
cask "font-firamono-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrainsmono-nerd-font"
cask "fritzing"
cask "gcc-arm-embedded"
cask "ghdl"
cask "godot-mono"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-drive-file-stream"
cask "gpg-suite"
cask "grammarly"
cask "gtkwave"
cask "hammerspoon"
cask "handbrake"
cask "hyper"
cask "iina"
cask "inkscape"
cask "insomnia"
cask "iterm2"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "keybase"
cask "keycastr"
cask "kindle"
cask "kitty"
cask "kotlin-native"
cask "little-snitch"
cask "logitech-presentation"
cask "macs-fan-control"
cask "magicavoxel"
cask "megacmd"
cask "micro-snitch"
cask "microsoft-edge"
cask "microsoft-teams"
cask "minecraft"
cask "monodraw"
cask "netron"
cask "ngrok"
cask "noti"
cask "notion"
cask "numi"
cask "obs"
cask "obs-virtualcam"
cask "obsidian"
cask "origin"
cask "parallels"
cask "pdf-expert"
cask "phoenix"
cask "postman"
cask "protonvpn"
cask "reactotron"
cask "rocket"
cask "setapp"
cask "silicon-labs-vcp-driver"
cask "sketch"
cask "skim"
cask "skyfonts"
cask "slack"
cask "smcfancontrol"
cask "spotify"
cask "steam"
cask "teamviewer"
cask "telegram"
cask "tiles"
cask "transmission"
cask "ubersicht"
cask "unity-hub"
cask "unshaky"
cask "vagrant"
cask "vagrant-manager"
cask "vcv-rack"
cask "veracrypt"
cask "vimr"
cask "virtualbox"
cask "visual-studio-code"
cask "visual-studio-code-insiders"
cask "vlc"
cask "wireshark"
cask "zenmap"
