tap "candid82/brew"
tap "cdr/coder"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "yqrashawn/goku"
brew "act"
brew "angle-grinder"
brew "aria2"
brew "bash"
brew "bat"
brew "cheat"
brew "cliclick"
brew "colordiff"
brew "coreutils"
brew "curl"
brew "diff-so-fancy"
brew "diffutils"
brew "editorconfig"
brew "emojify"
brew "entr"
brew "exa"
brew "expect"
brew "fd"
brew "findutils"
brew "fish"
brew "readline"
brew "sqlite"
brew "fpp"
brew "fzf"
brew "gh"
brew "gist"
brew "git"
brew "git-extras"
brew "git-flow"
brew "git-lfs"
brew "gnupg"
brew "grep"
brew "htop"
brew "jq"
brew "less"
brew "lnav"
brew "neofetch"
brew "neovim"
brew "openssh"
brew "ripgrep"
brew "rlwrap"
brew "tealdeer"
brew "the_silver_searcher"
brew "tig"
brew "tmux"
brew "tokei"
brew "unzip"
brew "wget"
brew "zsh"
brew "cdr/coder/coder-cli"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "yqrashawn/goku/goku"
cask "1password"
cask "1password-cli"
cask "alfred"
cask "blue-sherpa"
cask "cardhop"
cask "charles"
cask "contexts"
cask "daisydisk"
cask "discord"
cask "docker"
cask "dropbox"
cask "fantastical"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "handbrake"
cask "hey"
cask "insomnia"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "keybase"
cask "keyboard-maestro"
cask "kitty"
cask "little-snitch"
cask "logitech-presentation"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "obsidian"
cask "pdf-expert"
cask "raycast"
cask "sketch"
cask "slack"
cask "spotify"
cask "vanilla"
cask "visual-studio-code"
cask "wireshark"
