tap "apenngrace/vulkan"
tap "candid82/brew"
tap "clangen/musikcube"
tap "clojure/tools"
tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "jakehilborn/jakehilborn"
tap "koekeishiya/formulae"
tap "railwaycat/emacsmacport"
tap "yqrashawn/goku"
brew "angle-grinder"
brew "ansifilter"
brew "aria2"
brew "readline"
brew "python@3.9"
brew "asciinema"
brew "atlassian-cli"
brew "automake"
brew "bash"
brew "bat"
brew "bfg"
brew "blueutil"
brew "caddy"
brew "glib"
brew "pkg-config"
brew "libx11"
brew "carthage"
brew "cheat"
brew "circleci"
brew "cliclick"
brew "cmake"
brew "cmatrix"
brew "unbound"
brew "harfbuzz"
brew "srt"
brew "ffmpeg"
brew "cmus"
brew "cocoapods"
brew "colordiff"
brew "coreutils"
brew "cowsay"
brew "crystal"
brew "curl"
brew "deno", link: false
brew "diff-so-fancy"
brew "diffutils"
brew "direnv"
brew "editorconfig"
brew "elixir"
brew "emojify"
brew "entr"
brew "exa"
brew "exiftool"
brew "expect"
brew "fd"
brew "fdupes"
brew "figlet"
brew "findutils"
brew "fish"
brew "fortune"
brew "fpp"
brew "fzf"
brew "gdb"
brew "gdk-pixbuf"
brew "gh"
brew "ghc"
brew "ghostscript"
brew "gist"
brew "git"
brew "git-extras"
brew "git-flow"
brew "git-lfs"
brew "glslang", link: false
brew "glslviewer"
brew "gnupg"
brew "go"
brew "netpbm"
brew "librsvg"
brew "graphviz"
brew "grc"
brew "grep"
brew "hey"
brew "highlight"
brew "htop"
brew "hub"
brew "python@3.8"
brew "imagemagick"
brew "imlib2"
brew "jpegoptim"
brew "jq"
brew "k6"
brew "krb5"
brew "ldns"
brew "leiningen"
brew "less"
brew "libcaca"
brew "libfido2"
brew "libpq"
brew "libxml2"
brew "litecli"
brew "lnav"
brew "luarocks"
brew "molten-vk", link: false
brew "mosh"
brew "mycli"
brew "screenresolution"
brew "neofetch"
brew "neovim", args: ["HEAD"]
brew "nmap"
brew "openssh"
brew "pgcli"
brew "pngquant"
brew "poppler"
brew "postgresql", restart_service: true
brew "procs"
brew "pulumi"
brew "radare2"
brew "redis"
brew "ripgrep"
brew "rlwrap"
brew "ruby"
brew "screen"
brew "shellcheck"
brew "shpotify"
brew "socat"
brew "spotifyd"
brew "starship"
brew "switchaudio-osx"
brew "tcpdump"
brew "tealdeer"
brew "terraform"
brew "the_silver_searcher"
brew "thefuck"
brew "tig"
brew "tmux"
brew "toilet"
brew "tokei"
brew "tor"
brew "unrar"
brew "unzip"
brew "vifm"
brew "watchman"
brew "websocat"
brew "wget"
brew "xsv"
brew "zlib"
brew "zsh"
brew "clangen/musikcube/musikcube"
brew "clojure/tools/clojure"
brew "d12frosted/emacs-plus/emacs-plus@27", args: ["with-no-titlebar"]
brew "jakehilborn/jakehilborn/displayplacer"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "yqrashawn/goku/goku"
cask "1password"
cask "1password-cli"
cask "adobe-creative-cloud"
cask "airdroid"
cask "airtable"
cask "alacritty"
cask "alfred"
cask "audio-hijack"
cask "balenaetcher"
cask "basictex"
cask "calibre"
cask "charles"
cask "cloudflare-warp"
cask "contexts"
cask "daisydisk"
cask "dash"
cask "discord"
cask "docker"
cask "dropbox"
cask "elgato-game-capture-hd"
cask "fantastical"
cask "figma"
cask "fing"
cask "firecamp"
cask "firefox"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrainsmono-nerd-font"
cask "google-chrome"
cask "google-cloud-sdk"
cask "grammarly"
cask "graphql-playground"
cask "hammerspoon"
cask "handbrake"
cask "hey"
cask "home-assistant"
cask "insomnia"
cask "insomnia-designer"
cask "iterm2"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "keybase"
cask "keyboard-maestro"
cask "kindle"
cask "kite"
cask "kitty"
cask "logitech-presentation"
cask "loopback"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "minecraft"
cask "ngrok"
cask "noti"
cask "notion"
cask "obs"
cask "obsidian"
cask "osxfuse"
cask "parallels"
cask "pdf-expert"
cask "phoenix"
cask "physicseditor"
cask "postman"
cask "raycast"
cask "reflector"
cask "responsively"
cask "rocket"
cask "setapp"
cask "sf-symbols"
cask "sizzy"
cask "sketch"
cask "skim"
cask "slack"
cask "smcfancontrol"
cask "sonic-pi"
cask "spotify"
cask "steam"
cask "switchresx"
cask "synthesia"
cask "telegram"
cask "tex-live-utility"
cask "tor-browser"
cask "transmission"
cask "ubersicht"
cask "vagrant"
cask "vimr"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "vmware-fusion"
cask "vox"
cask "vulkan-sdk"
cask "webtorrent"
cask "webviewscreensaver"
cask "wireshark"
cask "xquartz"
cask "zoom"
