# Homebrew Taps

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/php"
tap "homebrew/science"
tap "homebrew/services"

# Shells
brew "bash"
brew "bash-completion@2"
brew "fish"
brew "zsh", args: ["without-etcdir"]
brew "xonsh"

# Revolver (Shell Loader)
tap "molovo/revolver"
brew "molovo/revolver/revolver"

# Mosh (Mobile)
brew "mosh"

# Vim and Neovim!
brew "ed"
brew "vim"
brew "neovim"

# TLDR - Shell Explainer
brew "tldr"

# Tokei (Word Token Counter)
brew "tokei"

# Terminal-based Browsers
brew "w3m"
brew "elinks"
brew "lynx"

# LNav (Log Navigator)
brew "lnav"

# NCDU (Kinda like DaisyDisk)
brew "ncdu"

# Tmux (Terminal Multiplexer)
brew "tmux"
brew "screen"

# NodeJS and Ruby
# brew "node", link: false
# brew "ruby"

# Bat (Colorized Cat)
brew "bat"

# Ag (Faster Grep)
brew "the_silver_searcher"

# Rg (Fastest Grep)
brew "ripgrep"

# Angle Grinder (Custom Parser)
brew "angle-grinder"

# FZF
brew "fzf"

# Git
brew "git"
brew "git-extras"
brew "git-flow"
brew "git-lfs"
brew "bfg"
brew "gist"

# Hub (Git Replacement for GitHub)
brew "hub"

# Tig (Git CLI)
brew "tig"

# Shellcheck - linter for shell files
brew "shellcheck"

# Spotify CLI
brew "shpotify"

# Audio Utilities
brew "sox"
brew "portaudio"

# Things CLI
tap "alexanderwillner/tap"
brew "alexanderwillner/tap/things.sh"

# DigitalOcean CLI
brew "doctl"

# Heroku CLI
tap "heroku/brew"
brew "heroku/brew/heroku"

# Htop (Alternative to `top`)
brew "htop"

# Fdupes: Find duplicate files
brew "fdupes"

# Utilities
brew "less"
brew "nasm"
brew "grc"
brew "gzip"
brew "unrar"
brew "unzip"
brew "grep"
brew "rename"
brew "rsync"
brew "wget"
brew "curl"

# Ruby Tools
brew "rbenv"
brew "rbspy"

# Python Tools
brew "pyenv"

# ImageMagick
brew "imagemagick"

# Telnet
brew "telnet"

# GNU Utils
brew "gnupg"
brew "gnutls"
brew "gnu-indent", args: ["with-default-names"]
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-which", args: ["with-default-names"]
brew "findutils", args: ["with-default-names"]
brew "diffutils"
brew "gawk"

# Databases
brew "postgresql", restart_service: true
brew "mysql"
brew "redis", restart_service: true

# Proxy Tools
brew "polipo"
brew "privoxy", restart_service: true
brew "proxychains-ng"
brew "mitmproxy"

# Ranger (File Explorer)
brew "ranger"

# The Fuck
brew "thefuck"

# PV: Progress Bar
brew "pv"

# JADX: Java Decompiler
brew "jadx"

# JQ: JSON Toolkit
brew "jq"

# Aircrack & Nmap (Pentest Tools)
brew "aircrack-ng"
brew "nmap"
brew "tcpdump"
brew "sqlmap"
brew "tcpkali"

# Reverse Engineering Tools
brew "capstone"
brew "gdb"

# FD - User-friendly `find`
brew "fd"

# Exa - Better `ls`
brew "exa"

# EditorConfig
brew "editorconfig"

# K6 (Load Tester)
tap "loadimpact/k6"
brew "loadimpact/k6/k6"

# Bazel (Build Tool)
tap "bazelbuild/tap", pin: true
brew "bazelbuild/tap/bazel"

# Dart
tap "dart-lang/dart"
brew "dart-lang/dart/dart@2"

# Scala and SBT
brew "gradle"
brew "scala"
brew "sbt"

# Database CLI
brew "mycli"
brew "pgcli"

# PlatformIO
brew "platformio"

# Java and Java 8
cask "java"
cask "java8"

# Clojure Things
brew "clojure"
brew "leiningen"
brew "planck"

# Kotlin
brew "kotlin"

# OSXFuse and XQuartz
cask "osxfuse"
cask "xquartz"
brew "ext4fuse"

# Emojify
brew "emojify"

# Z3 (SAT Solver)
brew "z3"

# Benchmarking Tools
brew "wrk"

# Build Essentials
brew "make"
brew "llvm"
brew "cmake"
brew "coreutils"
brew "ack"
brew "glib"
brew "openssl"
brew "openssh"
brew "pkg-config"
brew "pcre"
brew "gcc"
brew "boost"
brew "readline"
brew "ansifilter"
brew "rlwrap"
brew "m4"

# Autotools
brew "autoconf"
brew "autojump"
brew "automake"

# Build Dependencies (Libraries)
brew "libconfig"
brew "libdnet"
brew "libuv"
brew "zlib"
brew "libzip"
brew "libxml2"
brew "libmagic"
brew "libtool"
brew "libevent"
brew "libyaml"

# OpenCV
brew "opencv@2"

# Haskell
brew "haskell-stack"
# brew "haskell-platform" -- no longer needed

# Needed for Flutter
brew "ios-deploy"
brew "ideviceinstaller"
brew "libimobiledevice", args: ["HEAD"]

# GraphViz
brew "graphviz"

# Python 3 and 2
brew "python"
brew "python@2"

# APKTool (APK Reverse Engineering)
brew "apktool"

# Asciinema
brew "asciinema"

# FFMPEG
brew "ffmpeg"

# Elixir
brew "elixir"

# ZeroMQ Stuff
# brew "zeromq"
# brew "czmq", args: ["HEAD"]

# AVR Tools
# brew "avrdude"

# ------------------
#
#    Applications
#
# ------------------

# 1Password
cask "1password-cli"

# Alfred
cask "alfred"

# Atom Beta
cask "atom-beta"

# Charles
cask "charles"

# Docker
cask "docker"

# Fastlane
cask "fastlane"

# FIJI
cask "fiji"

# FuraCode, FuraMono & Hack
cask "font-firacode-nerd-font"
cask "font-firamono-nerd-font"
cask "font-hack-nerd-font"

# Genymotion
cask "genymotion"

# Drive File Stream
cask "google-drive-file-stream"

# Grammarly
cask "grammarly"

# GTKWave
cask "gtkwave"

# IINA (Media Player)
cask "iina"

# Karabiner Elements
cask "karabiner-elements"

# Keybase
cask "keybase"

# Kitty (Terminal)
cask "kitty"

# Netron (ML Model Explorer)
cask "netron"

# Sketch!
cask "sketch"

# SMC Fan Control
cask "smcfancontrol"

# Tor Browser
brew "tor", restart_service: true
cask "torbrowser"

# Vagrant & Vagrant Manager
cask "vagrant"
cask "vagrant-manager"

# VirtualBox
# cask "virtualbox"

# Visual Studio Code
cask "visual-studio-code"

# Wireshark
cask "wireshark"

# Zenmap (Nmap GUI)
cask "zenmap"

# Alfred x Numi Integration
tap "danielbayley/alfred"
cask "danielbayley/alfred/alfred-numi"
