tap "candid82/brew"
tap "esphen/wsta", "https://github.com/esphen/wsta.git"
tap "ethereum/ethereum"
tap "go-delve/delve"

tap "hybridgroup/tools"
tap "ivoputzer/tg"
tap "lampepfl/brew"
tap "linux-noah/noah"
tap "luckyframework/lucky"
tap "paritytech/paritytech"
tap "rockymadden/rockymadden"
tap "samueljohn/python"
tap "sidaf/pentest"
tap "sri-csl/sri-csl"
tap "stek29/idevice"

brew "amberframework/amber/amber"
brew "candid82/brew/joker"
brew "ethereum/ethereum/ethereum"
brew "ethereum/ethereum/solidity"
brew "hybridgroup/tools/gort"
brew "ivoputzer/tg/tg"
brew "lampepfl/brew/dotty"
brew "linux-noah/noah/noah"
brew "luckyframework/lucky/lucky"
brew "paritytech/paritytech/parity"
brew "rockymadden/rockymadden/slack-cli"
brew "sri-csl/sri-csl/yices2"
brew "stek29/idevice/fsmon"
brew "tidwall/jd/jd"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]

