

brew "gmp"
brew "emacs"
brew "agda"

brew "xz"
brew "glib"

brew "avrdude"
brew "bfg"
brew "caddy"
brew "cairo"
brew "capstone"
brew "chezscheme"
brew "rlwrap"
brew "clojure"
brew "cmake"
brew "coreutils"
brew "cowsay"
brew "libevent"
brew "libyaml"
brew "crystal"
brew "crystal-icr"
brew "jansson"
brew "curlftpfs"
brew "zeromq"
brew "czmq", args: ["HEAD"]
brew "daemonize"
brew "ddrescue"
brew "dep"
brew "diffutils"
brew "doctl"
brew "doitlive"
brew "ed"
brew "editorconfig"
brew "jpeg"
brew "elixir"
brew "emojify"
brew "ettercap"
brew "exa"
brew "ext4fuse"
brew "extract_url"
brew "fasd"
brew "fd"
brew "fdupes"
brew "sdl2"
brew "ffmpeg"
brew "libmagic"
brew "file-formula"
brew "findutils", args: ["with-default-names"]
brew "pango"
brew "fontforge"
brew "fwup"
brew "gawk"
brew "gdb"
brew "gist"
brew "glew"
brew "glide"
brew "glm"
brew "libksba"
brew "goenv"
brew "gpatch"
brew "gptfdisk"
brew "gradle"
brew "graphviz"
brew "grc"
brew "grep"
brew "gti"
brew "gzip"
brew "hardlink-osx"
brew "haskell-stack"
brew "highlight"
brew "htop"
brew "hyperfine"
brew "icarus-verilog"
brew "usbmuxd"
brew "ideviceinstaller"
brew "imagemagick"
brew "influxdb"
brew "ios-deploy"
brew "iproute2mac"
brew "ipython", link: false
brew "irssi"
brew "jadx"
brew "jq"
brew "jupyter"
brew "kotlin"
brew "kubernetes-helm"
brew "leiningen"
brew "less"
brew "leveldb"
brew "lftp"
brew "libconfig"
brew "libdnet"
brew "libuv"
brew "llvm"
brew "lnav"
brew "lolcat"
brew "lynx"
brew "m4"
brew "make"
brew "maven"
brew "megacmd"
brew "megatools"
brew "mercurial"
brew "midnight-commander"
brew "mitmproxy"
brew "mongodb"
brew "mono", link: false
brew "mosh"
brew "mtr"
brew "nasm"
brew "ngrep"
brew "nikto"
brew "portaudio"
brew "octave"
brew "opencv@2"

brew "p7zip"
brew "peco"

brew "pv"
brew "pyenv"
brew "pylibpcap"
brew "qemu"

brew "rbenv"
brew "rbspy"

brew "sbcl"
brew "scipy", link: false
brew "sdl2_ttf"
brew "sfml"
brew "sl"
brew "socat"
brew "sox"
brew "spark"
brew "sqlmap"
brew "squashfs"
brew "subversion"
brew "tcpdump"
brew "tcpkali"
brew "telnet"
brew "testdisk"
brew "the_silver_searcher"
brew "thefuck"
brew "tokei"
brew "tor", restart_service: true
brew "tree"
brew "unrar"
brew "unzip"
brew "urlview"
brew "watch"
brew "watchman"
brew "wdiff"
brew "websocat"
brew "weechat"
brew "wemux"
brew "wine"
brew "winetricks"
brew "wrk"
brew "xonsh"
brew "yafc"
brew "yank"
brew "yarn", args: ["without-node"]
brew "z3"
brew "zenity"
brew "zlib"
brew "zplug"

tap "alexanderwillner/tap"
tap "amberframework/amber"
tap "bazelbuild/tap", pin: true
tap "candid82/brew"
tap "danielbayley/alfred"
tap "dart-lang/dart"
tap "esphen/wsta", "https://github.com/esphen/wsta.git"
tap "ethereum/ethereum"
tap "go-delve/delve"

tap "hybridgroup/tools"
tap "ivoputzer/tg"
tap "lampepfl/brew"
tap "linux-noah/noah"
tap "loadimpact/k6"
tap "luckyframework/lucky"
tap "molovo/revolver"
tap "osx-cross/avr"
tap "paritytech/paritytech"
tap "rockymadden/rockymadden"
tap "samueljohn/python"
tap "sidaf/pentest"
tap "sri-csl/sri-csl"
tap "stek29/idevice"
tap "tidwall/jd"
tap "universal-ctags/universal-ctags"
tap "xo/xo"

brew "alexanderwillner/tap/things.sh"
brew "amberframework/amber/amber"
brew "bazelbuild/tap/bazel"
brew "candid82/brew/joker"
brew "dart-lang/dart/dart"
brew "dart-lang/dart/dart@2"
brew "ethereum/ethereum/ethereum"
brew "ethereum/ethereum/solidity"
brew "heroku/brew/heroku"
brew "hybridgroup/tools/gort"
brew "ivoputzer/tg/tg"
brew "lampepfl/brew/dotty"
brew "linux-noah/noah/noah"
brew "loadimpact/k6/k6"
brew "luckyframework/lucky/lucky"
brew "molovo/revolver/revolver"
brew "paritytech/paritytech/parity"
brew "rockymadden/rockymadden/slack-cli"
brew "sri-csl/sri-csl/yices2"
brew "stek29/idevice/fsmon"
brew "tidwall/jd/jd"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]

