tap "borkdude/brew"
tap "candid82/brew"
tap "cdr/coder"
tap "clojure/tools"
tap "d12frosted/emacs-plus"
tap "derailed/k9s"
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "jandedobbeleer/oh-my-posh"
tap "jdxcode/tap"
tap "koekeishiya/formulae"
tap "lencx/chatgpt", "https://github.com/lencx/ChatGPT.git"
tap "libsql/sqld"
tap "localsend/localsend"
tap "michaeleisel/zld"
tap "modularml/packages"
tap "mongodb/brew"
tap "nikitabobko/tap"
tap "osx-cross/avr"
tap "planetscale/tap"
tap "px4/px4"
tap "railwayapp/tap"
tap "riscv-software-src/riscv"
tap "stripe/stripe-cli"
tap "teamookla/speedtest"
tap "tinygo-org/tools"
tap "tursodatabase/tap"
tap "yqrashawn/goku"
brew "act"
brew "angle-grinder"
brew "giflib"
brew "zstd"
brew "jpeg-xl"
brew "aom"
brew "freetype"
brew "glib"
brew "pixman"
brew "cairo"
brew "harfbuzz"
brew "apktool"
brew "aria2"
brew "asio"
brew "assimp"
brew "boost"
brew "avrdude"
brew "bash"
brew "bat"
brew "binutils"
brew "bison"
brew "broot"
brew "btop"
brew "bullet"
brew "bundletool"
brew "eigen"
brew "gmp"
brew "isl"
brew "mpfr"
brew "libmpc"
brew "gcc"
brew "pkgconf"
brew "hdf5"
brew "cheat"
brew "chezmoi"
brew "clang-format"
brew "cliclick"
brew "cmake"
brew "cog"
brew "colordiff"
brew "console_bridge"
brew "coreutils"
brew "tinyxml2"
brew "cppcheck"
brew "crunch"
brew "llvm"
brew "crystal"
brew "cspice"
brew "csvkit"
brew "cunit"
brew "dex2jar"
brew "dfu-util"
brew "diff-so-fancy"
brew "diffutils"
brew "dive"
brew "duckdb"
brew "editorconfig"
brew "elan-init"
brew "unixodbc"
brew "erlang"
brew "elixir"
brew "emojify"
brew "entr"
brew "expat"
brew "expect"
brew "eza"
brew "fd"
brew "ferium"
brew "ffmpeg"
brew "ffuf"
brew "findutils"
brew "fish"
brew "flamegraph"
brew "fpp"
brew "fx"
brew "fzf"
brew "gawk"
brew "libavif"
brew "gd"
brew "gdk-pixbuf"
brew "gh"
brew "pango"
brew "tesseract"
brew "ghostscript"
brew "gist"
brew "git"
brew "git-extras"
brew "git-flow"
brew "git-lfs"
brew "glow"
brew "gnu-sed"
brew "gnu-typist"
brew "unbound"
brew "gnutls"
brew "gnupg"
brew "gnupg@1.4"
brew "gnuplot"
brew "gobject-introspection"
brew "gobuster"
brew "gradle"
brew "librsvg"
brew "graphviz"
brew "grep"
brew "haskell-stack"
brew "helix"
brew "hl"
brew "htop"
brew "httpie", link: false
brew "huggingface-cli"
brew "hyperfine"
brew "shared-mime-info"
brew "libheif"
brew "imagemagick"
brew "qpdf"
brew "inetutils"
brew "jadx"
brew "jpeg"
brew "jq"
brew "kotlin"
brew "lazydocker"
brew "lazygit"
brew "ldns"
brew "less"
brew "libfido2"
brew "python@3.12"
brew "liblqr"
brew "libmagic"
brew "libpq"
brew "libqalculate"
brew "libraw"
brew "lima"
brew "lnav"
brew "lsusb"
brew "luv"
brew "python@3.11"
brew "mathlibtools"
brew "micropython"
brew "mise"
brew "molten-vk"
brew "mongosh"
brew "mosh"
brew "mprocs"
brew "mysql-client"
brew "ncdu"
brew "ncspot"
brew "neofetch"
brew "neovim"
brew "neovide", link: false
brew "netcdf"
brew "nim"
brew "nmap"
brew "ntp"
brew "nushell"
brew "ocaml"
brew "ocrmypdf"
brew "ollama"
brew "opam"
brew "open-ocd"
brew "ripgrep"
brew "opencode"
brew "vtk"
brew "opencv"
brew "openssh"
brew "orocos-kdl"
brew "pbzip2"
brew "pcre"
brew "peco"
brew "pgcli"
brew "pgvector"
brew "php"
brew "pidcat"
brew "pinentry-mac"
brew "pipx", link: false
brew "planck"
brew "pnpm"
brew "pocketbase"
brew "poco"
brew "podman"
brew "postgresql@14"
brew "postgresql@15", restart_service: :changed
brew "protobuf-c"
brew "proxychains-ng"
brew "pulumi"
brew "py-spy", link: false
brew "qt@5"
brew "pyqt@5"
brew "python-tabulate", link: false
brew "python@3.10"
brew "python@3.9"
brew "qemu"
brew "qt"
brew "radare2"
brew "ranger"
brew "rizin"
brew "rlwrap"
brew "ruby"
brew "ruby-build"
brew "sccache"
brew "shellcheck"
brew "sip"
brew "spdlog"
brew "sshpass"
brew "starship"
brew "stylua"
brew "tailscale", link: false
brew "tealdeer"
brew "terminal-notifier"
brew "terraform"
brew "texinfo"
brew "the_silver_searcher"
brew "tig"
brew "tinyxml"
brew "tmux"
brew "tokei"
brew "tor"
brew "transmission-cli", restart_service: :changed
brew "ubi"
brew "unzip"
brew "vale"
brew "valkey"
brew "vercel-cli", link: false
brew "wasmer"
brew "websocat"
brew "wget"
brew "wimlib"
brew "wxwidgets"
brew "youtube-dl"
brew "zellij"
brew "zig"
brew "zlib"
brew "zsh"
brew "borkdude/brew/babashka"
brew "cdr/coder/coder@1"
brew "clojure/tools/clojure"
brew "derailed/k9s/k9s"
brew "felixkratz/formulae/sketchybar"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
brew "modularml/packages/modular"
brew "mongodb/brew/mongodb-database-tools"
brew "mongodb/brew/mongodb-community"
brew "mongodb/brew/mongodb-community-shell"
brew "osx-cross/avr/avr-gcc@9"
brew "planetscale/tap/pscale"
brew "px4/px4/gcc-arm-none-eabi-49"
brew "px4/px4/gcc-arm-none-eabi-83", link: false
brew "railwayapp/tap/nixpacks"
brew "riscv-software-src/riscv/riscv-tools"
brew "stripe/stripe-cli/stripe"
brew "teamookla/speedtest/speedtest"
brew "tinygo-org/tools/tinygo"
brew "tursodatabase/tap/turso"
brew "yqrashawn/goku/goku"
cask "1password"
cask "1password-cli"
cask "aerial"
cask "airtable"
cask "alfred"
cask "android-platform-tools"
cask "antigravity"
cask "audacity"
cask "autodesk-fusion"
cask "bambu-studio"
cask "betterdisplay"
cask "blender"
cask "brave-browser"
cask "bruno"
cask "calibre"
cask "cardhop"
cask "charles"
cask "chatgpt"
cask "claude"
cask "cloudflare-warp"
cask "coderabbit"
cask "codex"
cask "contexts"
cask "cutter"
cask "cyberduck"
cask "daisydisk"
cask "discord"
cask "fantastical"
cask "fig"
cask "fing-cli"
cask "firefox"
cask "font-commit-mono-nerd-font"
cask "font-geist-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-ia-writer-duo"
cask "font-ia-writer-mono"
cask "font-ia-writer-quattro"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-monaspace"
cask "font-monaspice-nerd-font"
cask "gcloud-cli"
cask "ghostty"
cask "github"
cask "google-chrome"
cask "hammerspoon"
cask "handbrake-app"
cask "hiddenbar"
cask "http-toolkit"
cask "httpie-desktop"
cask "iterm2"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "keyboard-maestro"
cask "keycastr"
cask "kitty"
cask "krisp"
cask "lens"
cask "linear-linear"
cask "little-snitch"
cask "llamachat"
cask "lm-studio"
cask "localsend"
cask "logitech-g-hub"
cask "logitech-presentation"
cask "logseq"
cask "loom"
cask "loopback"
cask "melodics"
cask "messenger"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "minecraft"
cask "mongodb-compass"
cask "monodraw"
cask "musescore"
cask "neovide-app"
cask "netron"
cask "nosql-workbench"
cask "notion"
cask "notion-calendar"
cask "obs"
cask "obsidian"
cask "omnifocus"
cask "opencode-desktop"
cask "openmtp"
cask "orbstack"
cask "origin"
cask "orion"
cask "parallels"
cask "pd"
cask "pdf-expert"
cask "plugdata"
cask "postman"
cask "prisma-studio"
cask "prismlauncher"
cask "raycast"
cask "redis-insight"
cask "reflector"
cask "script-kit"
cask "setapp"
cask "shortcat"
cask "shottr"
cask "sidequest"
cask "skim"
cask "slack"
cask "sonic-pi"
cask "spotify"
cask "steam"
cask "swiftbar"
cask "switchresx"
cask "synthesia"
cask "tabby"
cask "tailscale-app"
cask "telegram"
cask "tidal"
cask "todoist-app"
cask "topnotch"
cask "tor-browser"
cask "transmission-remote-gui"
cask "ubersicht"
cask "via"
cask "visual-studio-code"
cask "vmware-fusion"
cask "webtorrent"
cask "wezterm"
cask "whatsapp"
cask "windsurf"
cask "wireshark-app"
cask "xbar"
cask "zed"
cask "zen"
cask "zerotier-one"
cask "zoom"
cask "zotero"
vscode "aaron-bond.better-comments"
vscode "ahmadawais.shades-of-purple"
vscode "andrewleedham.vscode-css-modules"
vscode "antfu.browse-lite"
vscode "antfu.iconify"
vscode "antfu.icons-carbon"
vscode "antfu.unocss"
vscode "antfu.vite"
vscode "anthropic.claude-code"
vscode "ardenivanov.svelte-intellisense"
vscode "astro-build.astro-vscode"
vscode "austenc.tailwind-docs"
vscode "avetis.mono-atom"
vscode "betterthantomorrow.calva"
vscode "betterthantomorrow.calva-spritz"
vscode "boyswan.glsl-literal"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "cedricverlinden.cursor-dark"
vscode "christian-kohler.npm-intellisense"
vscode "continue.continue"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "dracula-theme.theme-dracula"
vscode "editorconfig.editorconfig"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "figma.figma-vscode-extension"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "firsttris.vscode-jest-runner"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "hbenl.vscode-test-explorer"
vscode "humao.rest-client"
vscode "jakebecker.elixir-ls"
vscode "johnlindquist.kit-extension"
vscode "limejuly.vscode-yaml-block-highlight"
vscode "mechatroner.rainbow-csv"
vscode "mongodb.mongodb-vscode"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vscode.vscode-speech"
vscode "naumovs.color-highlight"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "pveyes.aperture"
vscode "redhat.vscode-yaml"
vscode "robbowen.synthwave-vscode"
vscode "rust-lang.rust-analyzer"
vscode "sdras.night-owl"
vscode "seansassenrath.vscode-theme-superonedark"
vscode "shopify.ruby-lsp"
vscode "skyapps.fish-vscode"
vscode "slevesque.shader"
vscode "sst-dev.opencode"
vscode "stepanvanzuriak.mono"
vscode "styled-components.vscode-styled-components"
vscode "subframe7536.custom-ui-style"
vscode "svelte.svelte-vscode"
vscode "swellaby.rust-pack"
vscode "swellaby.vscode-rust-test-adapter"
vscode "tamasfe.even-better-toml"
vscode "tamuratak.vscode-lezer"
vscode "teabyii.ayu"
vscode "thebearingedge.vscode-sql-lit"
vscode "tomoki1207.pdf"
vscode "typescriptteam.native-preview"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "vunguyentuan.vscode-css-variables"
vscode "wakatime.vscode-wakatime"
vscode "wallabyjs.console-ninja"
vscode "wallabyjs.quokka-vscode"
vscode "wallabyjs.wallaby-extension-pack"
vscode "wallabyjs.wallaby-vscode"
vscode "withfig.fig"
vscode "xadillax.viml"
vscode "yummygum.city-lights-theme"
vscode "zhuangtongfa.material-theme"
vscode "ziglang.vscode-zig"
go "github.com/jpillora/chisel"
go "github.com/Clever/csvlint/cmd/csvlint"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/davidrjenni/reftools/cmd/fillstruct"
go "github.com/davidrjenni/reftools/cmd/fillswitch"
go "github.com/jon4hz/fztea"
go "github.com/abice/go-enum"
go "github.com/ramya-rao-a/go-outline"
go "golang.org/x/mobile/cmd/gobind"
go "github.com/segmentio/golines"
go "golang.org/x/mobile/cmd/gomobile"
go "github.com/fatih/gomodifytags"
go "github.com/abenz1267/gomvp"
go "golang.org/x/tools/gopls"
go "github.com/cweill/gotests/gotests"
go "gotest.tools/gotestsum"
go "golang.org/x/tools/cmd/guru"
go "github.com/josharian/impl"
go "github.com/tmc/json-to-struct"
go "kplus"
go "github.com/kyoh86/richgo"
go "honnef.co/go/tools/cmd/staticcheck"
cargo "apkeep"
cargo "bacon"
cargo "cargo-edit"
cargo "cargo-expand"
cargo "cargo-generate"
cargo "cargo-info"
cargo "cargo-watch"
cargo "code-minimap"
cargo "du-dust"
cargo "evcxr_jupyter"
cargo "gitui"
cargo "irust"
cargo "porsmo"
cargo "ravedude"
cargo "rsw"
cargo "safetensors_explorer"
cargo "skim"
cargo "speedtest-rs"
cargo "trunk"
cargo "wasm-bindgen-cli"
cargo "wasm-pack"
cargo "wiki-tui"
cargo "worker-build"
