jorgebucaran/fisher
PatrickF1/fzf.fish
oh-my-fish/theme-bobthefish
jethrokuan/z
jorgebucaran/nvm.fish
franciscolourenco/done
jorgebucaran/spark.fish
jorgebucaran/replay.fish
jorgebucaran/gitio.fish
jorgebucaran/autopair.fish
acomagu/fish-async-prompt
